{"keras_version": "2.0.8", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true, "bias_regularizer": null, "batch_input_shape": [null, null, null, 3], "filters": 32, "activation": "relu", "name": "conv2d_1", "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [7, 7], "padding": "valid", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "filters": 32, "activation": "relu", "name": "conv2d_2", "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [7, 7], "padding": "valid", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "filters": 64, "activation": "relu", "name": "conv2d_3", "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [5, 5], "padding": "valid", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "filters": 64, "activation": "relu", "name": "conv2d_4", "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [5, 5], "padding": "valid", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "filters": 128, "activation": "relu", "name": "conv2d_5", "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "filters": 2, "activation": "softmax", "name": "conv2d_6", "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}], "backend": "tensorflow"}