{"keras_version": "2.0.8", "config": [{"config": {"trainable": true, "activation": "relu", "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [7, 7], "use_bias": true, "activity_regularizer": null, "batch_input_shape": [null, null, null, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "dtype": "float32", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "filters": 32}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [7, 7], "use_bias": true, "activity_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 32}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [5, 5], "use_bias": true, "activity_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 64}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [5, 5], "use_bias": true, "activity_regularizer": null, "name": "conv2d_4", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 64}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "name": "conv2d_5", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 128}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "softmax", "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "name": "conv2d_6", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 3}, "class_name": "Conv2D"}], "backend": "tensorflow", "class_name": "Sequential"}