{"config": [{"config": {"bias_constraint": null, "dtype": "float32", "filters": 32, "batch_input_shape": [null, 25, 25, 3], "kernel_constraint": null, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "padding": "valid", "activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "padding": "valid", "activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "padding": "valid", "activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "padding": "valid", "activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "units": 1024, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"rate": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "units": 2, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}], "keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential"}