{"backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 25, 25, 3], "bias_constraint": null, "name": "conv2d_1", "padding": "valid", "trainable": true, "filters": 32, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "conv2d_2", "padding": "valid", "filters": 32, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "conv2d_3", "padding": "valid", "filters": 64, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "conv2d_4", "padding": "valid", "filters": 64, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_2", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "bias_constraint": null, "name": "dense_2", "kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "trainable": true}}], "class_name": "Sequential", "keras_version": "2.0.8"}