{"backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activation": "relu", "padding": "valid", "kernel_regularizer": null, "data_format": "channels_last", "batch_input_shape": [null, 25, 25, 3], "name": "conv2d_1", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "bias_constraint": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activation": "relu", "padding": "valid", "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_2", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activation": "relu", "padding": "valid", "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_3", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activation": "relu", "padding": "valid", "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_4", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "use_bias": true, "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 1024}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"activation": "softmax", "use_bias": true, "bias_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 21}}], "keras_version": "2.0.8", "class_name": "Sequential"}