{"config": [{"config": {"kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "name": "conv2d_1", "filters": 32, "dtype": "float32", "batch_input_shape": [null, 25, 25, 3], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "name": "conv2d_2", "filters": 32, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "name": "conv2d_3", "filters": 64, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "name": "conv2d_4", "filters": 64, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "units": 1024, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "units": 2, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8"}