{"config": [{"config": {"kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "activation": "relu", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "batch_input_shape": [null, 25, 25, 3], "data_format": "channels_last", "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 32, "activation": "relu", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "activation": "relu", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_3", "data_format": "channels_last", "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "activation": "relu", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_4", "data_format": "channels_last", "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "name": "dense_1", "kernel_regularizer": null, "units": 1024, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "trainable": true, "name": "dense_2", "kernel_regularizer": null, "units": 2, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8"}