{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [7, 7], "kernel_constraint": null, "dtype": "float32", "batch_input_shape": [null, null, null, 3], "bias_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "filters": 32, "padding": "valid", "activation": "relu", "dilation_rate": [1, 1], "name": "conv2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [7, 7], "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 32, "padding": "valid", "activation": "relu", "dilation_rate": [1, 1], "name": "conv2d_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 64, "padding": "valid", "activation": "relu", "dilation_rate": [1, 1], "name": "conv2d_3"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 64, "padding": "valid", "activation": "relu", "dilation_rate": [1, 1], "name": "conv2d_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 128, "padding": "valid", "activation": "relu", "dilation_rate": [1, 1], "name": "conv2d_5"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 3, "padding": "valid", "activation": "softmax", "dilation_rate": [1, 1], "name": "conv2d_6"}}]}