{"keras_version": "2.0.8", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "valid", "batch_input_shape": [null, 16, 16, 3], "strides": [1, 1], "dtype": "float32", "filters": 32, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_3"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_4"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "units": 256, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"activation": "softmax", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "units": 3, "name": "dense_2"}}], "class_name": "Sequential"}