{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "batch_input_shape": [null, 25, 25, 3], "filters": 32, "use_bias": true, "name": "conv2d_1", "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "filters": 32, "use_bias": true, "name": "conv2d_2", "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"trainable": true, "filters": 64, "use_bias": true, "name": "conv2d_3", "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "filters": 64, "use_bias": true, "name": "conv2d_4", "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "name": "dense_1", "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "units": 1024}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "name": "dense_2", "activation": "softmax", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "units": 2}}], "keras_version": "2.0.8"}