{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "dtype": "float32", "dilation_rate": [1, 1], "bias_constraint": null, "batch_input_shape": [null, 25, 25, 3], "padding": "valid", "filters": 32, "use_bias": true}}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "filters": 32, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "filters": 64, "use_bias": true}}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "filters": 64, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "units": 1024, "name": "dense_1", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.5}}, {"class_name": "Dense", "config": {"activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "units": 2, "name": "dense_2", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true}}], "keras_version": "2.0.8", "backend": "tensorflow"}