{"config": [{"config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "batch_input_shape": [null, 25, 25, 3], "name": "conv2d_1", "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "name": "conv2d_2", "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "name": "conv2d_3", "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "name": "conv2d_4", "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1024, "use_bias": true, "name": "dense_1", "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 2, "use_bias": true, "name": "dense_2", "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8"}