{"keras_version": "2.0.8", "config": [{"config": {"bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "batch_input_shape": [null, 25, 25, 3], "kernel_regularizer": null, "trainable": true, "name": "conv2d_1", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "conv2d_2", "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "conv2d_3", "strides": [1, 1], "filters": 64, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "conv2d_4", "strides": [1, 1], "filters": 64, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"units": 1024, "trainable": true, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"units": 2, "trainable": true, "name": "dense_2", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}