{"backend": "tensorflow", "keras_version": "2.0.8", "config": [{"config": {"strides": [1, 1], "dtype": "float32", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 25, 25, 3], "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_1", "padding": "valid", "bias_regularizer": null, "trainable": true, "filters": 32, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "data_format": "channels_last", "bias_constraint": null, "padding": "valid", "bias_regularizer": null, "trainable": true, "filters": 32, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "data_format": "channels_last", "bias_constraint": null, "padding": "valid", "bias_regularizer": null, "trainable": true, "filters": 64, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "data_format": "channels_last", "bias_constraint": null, "padding": "valid", "bias_regularizer": null, "trainable": true, "filters": 64, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 1024}, "class_name": "Dense"}, {"config": {"rate": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 2}, "class_name": "Dense"}], "class_name": "Sequential"}