{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [7, 7], "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "padding": "valid", "dtype": "float32", "batch_input_shape": [null, null, null, 3], "kernel_regularizer": null, "use_bias": true, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"filters": 32, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [7, 7], "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "padding": "valid", "use_bias": true, "kernel_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 64, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "padding": "valid", "use_bias": true, "kernel_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"filters": 64, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "padding": "valid", "use_bias": true, "kernel_regularizer": null, "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_2", "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 128, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "padding": "valid", "use_bias": true, "kernel_regularizer": null, "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"filters": 3, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "strides": [1, 1], "padding": "valid", "use_bias": true, "kernel_regularizer": null, "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "bias_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.0.8"}