{"config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, null, null, 3], "bias_constraint": null, "dtype": "float32", "trainable": true, "name": "conv2d_1", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "filters": 16, "strides": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "filters": 16, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "rate": 0.25, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "filters": 16, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "filters": 16, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "rate": 0.25, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "filters": 16, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "filters": 16, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_3", "rate": 0.25, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "filters": 16, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "filters": 16, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_4", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_4", "rate": 0.25, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "filters": 16, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_10", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "filters": 16, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_5", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_11", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "filters": 4, "strides": [1, 1], "kernel_size": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "activity_regularizer": null, "kernel_regularizer": null}}], "class_name": "Sequential", "keras_version": "2.1.5", "backend": "tensorflow"}